DataProcessors/ПечатьКарточкиДолжниковПоРеестру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПечатьКарточкиДолжниковПоРеестру</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДанныеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Реестр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Реестр</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>InformationRegister.НачальныеДанныеДоговора</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.ДатыУчетаДоговоров</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьКакНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныйОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неустойка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Госпошлина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработанФССП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатЗапросаВФССП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписанВРегистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПечатьКарточкиДолжниковПоРеестру/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПечатьНаСервере()
	
	      табл=Новый Массив;
	
	         	Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	РеестрДолжники.Должник КАК Должник
					|ИЗ
					|	Документ.Реестр.Должники КАК РеестрДолжники
					|ГДЕ
					|	РеестрДолжники.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", Объект.Реестр);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					//Таблица = Новый ТабличныйДокумент;
					
				//	ОбработкаОтчета = Отчеты.КарточкаДолжника.Создать();
				//    ОбработкаОтчета.Должник = ВыборкаДетальныеЗаписи.Должник;
				//    ОбработкаОтчета.КарточкаДолжника(Таблица, ВыборкаДетальныеЗаписи.Должник);
				//	
				////	Таблица.Защита = Истина;
				//Таблица.ТолькоПросмотр = Истина;
				//    Таблица.Показать("Карточка " + Строка(ВыборкаДетальныеЗаписи.Должник));
					
				  табл.Добавить(ВыборкаДетальныеЗаписи.Должник);
				  
				
				КонецЦикла;
				
		Возврат табл;		
				
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	
	//Таблица = Новый ТабличныйДокумент;
	
      масс=ПечатьНаСервере();
	  
	  
	  ТабДокумент= ПолучитьМакетСформироватьНаСервере(масс);
	  
	  
	  ТабДокумент.Показать();
	  
	  //
	//Таблица.Защита = Истина;
	//Таблица.ТолькоПросмотр = Истина;
	//
	//Таблица.Показать("Карточка ");
	//	
		
		
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетСформироватьНаСервере(масс)
	
	   Перем ДатаАктуальности;
	
	   ДатаАктуальности = ТекущаяДата();
	
	    ТабДокумент=Новый ТабличныйДокумент;
    	ТабДокумент.АвтоМасштаб=Истина;
	    ТабДокумент.ТолькоПросмотр=Истина;
		
	    Макет = Отчеты.КарточкаДолжника.ПолучитьМакет("КарточкаДолжника");
		
		
		//Секция = Макет.ПолучитьОбласть("Шапка");
		//
		//
		//ТабДокумент.Вывести(Секция);
		Для Каждого элем из масс Цикл
			
			Запрос = Новый Запрос;
		  	Запрос.Текст = 	"ВЫБРАТЬ
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущийОсновнойДолг) КАК ТекущийОсновнойДолг,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ВсегоЗадолженность) КАК ВсегоЗадолженность,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныеПроценты) КАК ПросроченныеПроценты,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг) КАК ПросроченныйОсновнойДолг,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.Неустойка) КАК Неустойка,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ДнейПросрочки) КАК ДнейПросрочки,
			               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
			               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка КАК Договор,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущиеПроценты) КАК ТекущиеПроценты,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.Госпошлина) КАК Госпошлина,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.Прочее) КАК Прочее
			               	|ИЗ
			               	|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&Момент, Договор.Владелец = &Должник) КАК ДанныеДоговоровСрезПоследних
			               	|
			               	|СГРУППИРОВАТЬ ПО
			               	|	ДанныеДоговоровСрезПоследних.Договор,
			               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности,
			               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка";
			
			Запрос.УстановитьПараметр("Момент",  ДатаАктуальности);
			Запрос.УстановитьПараметр("Должник", элем);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			
		    Секция = Макет.ПолучитьОбласть("Шапка");
			Секция.Параметры.ФИО=элем.Наименование;
			
			
			
			МестоРаботы = "";
			ДополнительныеДанные = Справочники.ДополнительныеДанные.Выбрать(, элем);
			Пока ДополнительныеДанные.Следующий() = 1 Цикл
				Если ДополнительныеДанные.Реквизит.Пустая() = 0 Тогда
					Если СокрЛП(ДополнительныеДанные.Реквизит.Наименование)  = "Место работы (наименование организации)" Тогда
						МестоРаботы = СокрЛП(ДополнительныеДанные.Наименование);
						Прервать;
					КонецЕсли
				КонецЕсли
			КонецЦикла;

			ДопДанные=Макет.ПолучитьОбласть("ДопДанные");
			ДопДанные.Параметры.ГодРождения=элем.ДатаРождения;
			ДопДанные.Параметры.МестоРаботы=МестоРаботы;
			ДопДанные.Параметры["ПаспортныеДанные"] = СокрЛП(элем.НомерПаспорта);

			
			// Телефоны
			
	        ТелефоныОбл= Макет.ПолучитьОбласть("Телефоны");
			 
		    Телефоны = Справочники.Телефоны.Выбрать(, элем);
						
              			
			
		    ТабДокумент.Присоединить(Секция);
			ТабДокумент.Присоединить(ДопДанные);
			ТабДокумент.Присоединить(ТелефоныОбл);
			Пока Телефоны.Следующий() Цикл
				 ОбластьТелефон=Макет.ПолучитьОбласть("Телефон");
				 ОбластьТелефон.Параметры["НомерТелефона"] = Телефоны.Наименование;
				 ТабДокумент.Присоединить(ОбластьТелефон);
			КонецЦикла;  

			
            АдресаОбл=Макет.ПолучитьОбласть("Адреса");  
			ТабДокумент.Присоединить(АдресаОбл);
			
			
			
			
			// Адреса
	 	    Адреса = Справочники.Адреса.Выбрать(, элем);
			Пока Адреса.Следующий() Цикл
				ОбластьАдрес=Макет.ПолучитьОбласть("Адрес");
				ОбластьАдрес.Параметры["Адрес"] = Адреса.Наименование;
				ОбластьАдрес.Параметры["ТипАдреса"] = Адреса.Тип;
				ТабДокумент.Присоединить(ОбластьАдрес);
			КонецЦикла;  
			
		  //  Договор
		  Для каждого СтрокаДоговоры Из Результат Цикл
			  
			    ОбластьДоговор=Макет.ПолучитьОбласть("Договор");
				
				ОбластьДоговор.Параметры.Заполнить(СтрокаДоговоры);
				ОбластьДоговор.Параметры["ДатаАктуальности"] = ДатаАктуальности;
				спрДоговор=СтрокаДоговоры.Договор.ПолучитьОбъект();
				ОбластьДоговор.Параметры["НомерДоговора"]= спрДоговор.НомерДоговора;
				ОбластьДоговор.Параметры["ДатаФинансирования"]= спрДоговор.ДатаФинансирования;
				ОбластьДоговор.Параметры["Банк"]= спрДоговор.Банк;
				ТабДокумент.Присоединить(ОбластьДоговор);
		  КонецЦикла; 
			

		  КонтактыОбл=Макет.ПолучитьОбласть("Контакты");
		  ТабДокумент.Присоединить(КонтактыОбл);
			
			
		   // Контакты
			Отбор = Новый Структура("Должник", элем);
			
			
			
			Контакты = Документы.Контакт.Выбрать(,,Отбор);
			Пока Контакты.Следующий() Цикл
				
				ОбластьКонтакт=Макет.ПолучитьОбласть("Контакт");
				
				ОбластьКонтакт.Параметры["ОписаниеКонтакта"] 	= Строка(Контакты.Дата) + ", " + Строка(Контакты.ТипКонтакта) + ", причина неплатежа: " + Строка(Контакты.ПричинаНеплатежа);
				ОбластьКонтакт.Параметры["Комментарий"] 		= Контакты.Комментарий;
				ТабДокумент.Присоединить(ОбластьКонтакт);
			КонецЦикла;  
			

			Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 3);
			Макет.Область("Шапка").ГраницаСверху = Линия; 
			
			//Секция.ГраницаСверху = Линия;
			
		  
			
			
		КонецЦикла;
		
		
		
		Возврат  ТабДокумент;

		
		
		
  
	
	
КонецФункции	



&НаСервере
Процедура ЗаполнитьКарточкуНаСервере(Таблица, Знач ТекДолжник)
	
	//ОбработкаОтчета = Отчеты.КарточкаДолжника.Создать();
	//ОбработкаОтчета.Должник = ТекДолжник;
	//ОбработкаОтчета.КарточкаДолжника(Таблица, ТекДолжник);
	
КонецПроцедуры
